#ifndef __MESSAGE_DEFINE_H_
#define __MESSAGE_DEFINE_H_

/************************************************************************/
/*                              消息定义规范                            */
/* 1、游戏服务器发给客户端的加 "s2c_".                                  */
/* 2、登陆服务器发给客户端的加 "ls2c_".                                 */
/* 3、客户端发给游戏服务器的加 "c2s_".                                  */
/* 4、客户端发给登陆服务器的加 "c2ls_".                                 */
/* 3、如果客户端和服务器都要收发的加 "x2x_".                            */
/************************************************************************/



enum emsgid
{
  x2x_message_heart,
  
  max_message = 65535
};

#endif /* __MESSAGE_DEFINE_H_ */
